Revit 2027 API
Application.NewGBXMLImportOptions Method
Creates Green-Building XML Import options.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public GBXMLImportOptions NewGBXMLImportOptions()
Public Function NewGBXMLImportOptions As GBXMLImportOptions
public:
GBXMLImportOptions^ NewGBXMLImportOptions()
member NewGBXMLImportOptions : unit -> GBXMLImportOptions
Return Value
GBXMLImportOptions
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace